zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CANXL_GRP_CONTROL.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CANXL_GRP_CONTROL
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CANXL_GRP_CONTROL_H_)  /* Check if memory map has not been already included */
#define S32K566_CANXL_GRP_CONTROL_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CANXL_GRP_CONTROL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_GRP_CONTROL_Peripheral_Access_Layer CANXL_GRP_CONTROL Peripheral Access Layer
 * @{
 */

/** CANXL_GRP_CONTROL - Size of Registers Arrays */
#define CANXL_GRP_CONTROL_DSCACTIVEARRAY_COUNT    4u
#define CANXL_GRP_CONTROL_FIFOCTRLREQ_COUNT       4u
#define CANXL_GRP_CONTROL_TXIFLAGARRAY_COUNT      4u
#define CANXL_GRP_CONTROL_MSGIMASKARRAY_COUNT     4u
#define CANXL_GRP_CONTROL_FRMDARRAY_COUNT         4u
#define CANXL_GRP_CONTROL_DSCABTPNDARRAY_COUNT    4u
#define CANXL_GRP_CONTROL_OVERRUNFARRAY_COUNT     4u
#define CANXL_GRP_CONTROL_URUNFARRAY_COUNT        4u

/** CANXL_GRP_CONTROL - Register Layout Typedef */
typedef struct CANXL_GRP_CONTROL_Struct {
  __IO uint32_t DSCCTRL;                           /**< Descriptors Control, offset: 0x0 */
  __I  uint32_t DSCACTIVE[CANXL_GRP_CONTROL_DSCACTIVEARRAY_COUNT]; /**< Descriptor Activation 1..Descriptor Activation 4, array offset: 0x4, array step: 0x4 */
  __IO uint32_t FIFOCTRL[CANXL_GRP_CONTROL_FIFOCTRLREQ_COUNT]; /**< Message FIFO Control 1..Message FIFO Control 4, array offset: 0x14, array step: 0x4 */
  uint8_t RESERVED_0[48];
  __IO uint32_t MSGIFLAG[CANXL_GRP_CONTROL_TXIFLAGARRAY_COUNT]; /**< Message Interrupt FLAG 1..Message Interrupt FLAG 4, array offset: 0x54, array step: 0x4 */
  uint8_t RESERVED_1[16];
  __IO uint32_t MSGIMASK[CANXL_GRP_CONTROL_MSGIMASKARRAY_COUNT]; /**< Message Interrupt Mask 1..Message Interrupt Mask 4, array offset: 0x74, array step: 0x4 */
  uint8_t RESERVED_2[16];
  __IO uint32_t FREEDSC0;                          /**< Free Descriptor Index 0, offset: 0x94 */
  uint8_t RESERVED_3[8];
  __I  uint32_t FRMD[CANXL_GRP_CONTROL_FRMDARRAY_COUNT]; /**< Free to Receive Message Descriptor 1..Free to Receive Message Descriptor 4, array offset: 0xA0, array step: 0x4 */
  __I  uint32_t DSCABTPND[CANXL_GRP_CONTROL_DSCABTPNDARRAY_COUNT]; /**< Descriptor Abort Request Pending Status 1..Descriptor Abort Request Pending Status 4, array offset: 0xB0, array step: 0x4 */
  uint8_t RESERVED_4[72];
  __IO uint32_t OVERRUNF[CANXL_GRP_CONTROL_OVERRUNFARRAY_COUNT]; /**< Descriptor Overrun Flag 1..Descriptor Overrun Flag 4, array offset: 0x108, array step: 0x4 */
  uint8_t RESERVED_5[32];
  __IO uint32_t URUNF[CANXL_GRP_CONTROL_URUNFARRAY_COUNT]; /**< Under Run Flag 1..Under Run Flag 4, array offset: 0x138, array step: 0x4 */
} CANXL_GRP_CONTROL_Type, *CANXL_GRP_CONTROL_MemMapPtr;

/** Number of instances of the CANXL_GRP_CONTROL module. */
#define CANXL_GRP_CONTROL_INSTANCE_COUNT         (1u)

/* CANXL_GRP_CONTROL - Peripheral instance base addresses */
/** Peripheral CANEXCEL__GRP_CONTROL base address */
#define IP_CANEXCEL__GRP_CONTROL_BASE            (0x6A026000u)
/** Peripheral CANEXCEL__GRP_CONTROL base pointer */
#define IP_CANEXCEL__GRP_CONTROL                 ((CANXL_GRP_CONTROL_Type *)IP_CANEXCEL__GRP_CONTROL_BASE)
/** Array initializer of CANXL_GRP_CONTROL peripheral base addresses */
#define IP_CANXL_GRP_CONTROL_BASE_ADDRS          { IP_CANEXCEL__GRP_CONTROL_BASE }
/** Array initializer of CANXL_GRP_CONTROL peripheral base pointers */
#define IP_CANXL_GRP_CONTROL_BASE_PTRS           { IP_CANEXCEL__GRP_CONTROL }

/* ----------------------------------------------------------------------------
   -- CANXL_GRP_CONTROL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CANXL_GRP_CONTROL_Register_Masks CANXL_GRP_CONTROL Register Masks
 * @{
 */

/*! @name DSCCTRL - Descriptors Control */
/*! @{ */

#define CANXL_GRP_CONTROL_DSCCTRL_TXDSC_MASK     (0x7FU)
#define CANXL_GRP_CONTROL_DSCCTRL_TXDSC_SHIFT    (0U)
#define CANXL_GRP_CONTROL_DSCCTRL_TXDSC_WIDTH    (7U)
#define CANXL_GRP_CONTROL_DSCCTRL_TXDSC(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCCTRL_TXDSC_SHIFT)) & CANXL_GRP_CONTROL_DSCCTRL_TXDSC_MASK)
/*! @} */

/*! @name DSCACTIVE - Descriptor Activation 1..Descriptor Activation 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT0_MASK  (0x1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT0_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT0_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT0(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT0_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT0_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT1_MASK  (0x2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT1_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT1_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT1(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT1_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT1_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT2_MASK  (0x4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT2_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT2_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT2(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT2_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT2_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT3_MASK  (0x8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT3_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT3_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT3(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT3_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT3_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT4_MASK  (0x10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT4_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT4_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT4(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT4_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT4_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT5_MASK  (0x20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT5_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT5_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT5(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT5_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT5_MASK)

