zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT6_MASK  (0x40U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT6_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT6_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT6(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT6_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT6_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT7_MASK  (0x80U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT7_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT7_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT7(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT7_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT7_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT8_MASK  (0x100U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT8_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT8_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT8(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT8_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT8_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT9_MASK  (0x200U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT9_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT9_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT9(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT9_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT9_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT10_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT10_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT10_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT10(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT10_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT10_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT11_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT11_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT11_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT11(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT11_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT11_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT12_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT12_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT12_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT12(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT12_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT12_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT13_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT13_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT13_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT13(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT13_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT13_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT14_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT14_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT14_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT14(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT14_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT14_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT15_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT15_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT15_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT15(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT15_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT15_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT16_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT16_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT16_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT16(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT16_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT16_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT17_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT17_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT17_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT17(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT17_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT17_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT18_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT18_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT18_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT18(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT18_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT18_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT19_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT19_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT19_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT19(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT19_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT19_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT20_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT20_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT20_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT20(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT20_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT20_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT21_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT21_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT21_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT21(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT21_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT21_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT22_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT22_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT22_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT22(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT22_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT22_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT23_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT23_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT23_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT23(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT23_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT23_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT24_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT24_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT24_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT24(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT24_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT24_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT25_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT25_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT25_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT25(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT25_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT25_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT26_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT26_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT26_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT26_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT26_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT27_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT27_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT27_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT27_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT27_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT28_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT28_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT28_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT28(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT28_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT28_MASK)

