zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT29_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT29_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT29_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT29(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT29_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT29_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT30_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT30_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT30_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT30(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT30_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT30_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT31_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT31_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT31_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT31(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT31_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT31_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT32_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT32_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT32_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT32(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT32_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT32_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT33_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT33_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT33_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT33(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT33_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT33_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT34_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT34_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT34_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT34(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT34_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT34_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT35_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT35_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT35_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT35(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT35_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT35_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT36_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT36_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT36_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT36(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT36_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT36_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT37_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT37_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT37_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT37(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT37_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT37_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT38_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT38_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT38_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT38(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT38_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT38_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT39_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT39_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT39_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT39(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT39_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT39_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT40_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT40_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT40_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT40(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT40_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT40_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT41_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT41_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT41_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT41(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT41_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT41_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT42_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT42_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT42_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT42(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT42_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT42_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT43_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT43_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT43_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT43(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT43_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT43_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT44_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT44_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT44_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT44(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT44_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT44_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT45_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT45_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT45_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT45(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT45_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT45_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT46_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT46_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT46_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT46(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT46_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT46_MASK)

