zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT47_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT47_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT47_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT47(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT47_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT47_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT48_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT48_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT48_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT48(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT48_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT48_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT49_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT49_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT49_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT49(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT49_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT49_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT50_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT50_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT50_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT50(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT50_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT50_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT51_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT51_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT51_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT51(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT51_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT51_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT52_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT52_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT52_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT52(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT52_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT52_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT53_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT53_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT53_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT53(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT53_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT53_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT54_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT54_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT54_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT54(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT54_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT54_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT55_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT55_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT55_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT55(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT55_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT55_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT56_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT56_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT56_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT56(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT56_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT56_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT57_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT57_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT57_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT57(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT57_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT57_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT58_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT58_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT58_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT58(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT58_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT58_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT59_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT59_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT59_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT59(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT59_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT59_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT60_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT60_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT60_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT60(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT60_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT60_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT61_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT61_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT61_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT61(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT61_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT61_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT62_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT62_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT62_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT62(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT62_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT62_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT63_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT63_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT63_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT63(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT63_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT63_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT64_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT64_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT64_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT64(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT64_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT64_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT65_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT65_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT65_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT65(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT65_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT65_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT66_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT66_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT66_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT66(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT66_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT66_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT67_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT67_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT67_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT67(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT67_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT67_MASK)

