zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT68_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT68_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT68_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT68(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT68_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT68_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT69_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT69_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT69_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT69(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT69_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT69_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT70_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT70_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT70_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT70(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT70_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT70_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT71_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT71_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT71_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT71(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT71_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT71_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT72_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT72_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT72_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT72(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT72_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT72_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT73_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT73_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT73_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT73(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT73_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT73_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT74_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT74_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT74_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT74(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT74_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT74_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT75_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT75_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT75_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT75(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT75_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT75_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT76_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT76_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT76_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT76(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT76_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT76_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT77_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT77_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT77_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT77(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT77_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT77_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT78_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT78_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT78_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT78(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT78_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT78_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT79_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT79_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT79_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT79(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT79_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT79_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT80_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT80_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT80_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT80(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT80_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT80_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT81_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT81_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT81_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT81(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT81_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT81_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT82_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT82_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT82_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT82(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT82_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT82_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT83_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT83_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT83_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT83(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT83_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT83_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT84_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT84_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT84_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT84(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT84_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT84_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT85_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT85_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT85_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT85(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT85_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT85_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT86_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT86_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT86_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT86(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT86_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT86_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT87_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT87_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT87_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT87(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT87_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT87_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT88_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT88_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT88_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT88(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT88_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT88_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT89_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT89_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT89_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT89(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT89_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT89_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT90_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT90_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT90_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT90(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT90_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT90_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT91_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT91_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT91_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT91(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT91_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT91_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT92_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT92_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT92_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT92(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT92_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT92_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT93_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT93_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT93_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT93(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT93_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT93_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT94_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT94_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT94_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT94(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT94_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT94_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT95_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT95_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT95_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT95(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT95_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT95_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT96_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT96_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT96_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT96(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT96_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT96_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT97_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT97_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT97_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT97(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT97_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT97_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT98_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT98_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT98_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT98(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT98_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT98_MASK)

