zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT99_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT99_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT99_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT99(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT99_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT99_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT100_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT100_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT100_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT100(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT100_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT100_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT101_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT101_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT101_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT101(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT101_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT101_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT102_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT102_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT102_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT102(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT102_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT102_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT103_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT103_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT103_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT103(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT103_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT103_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT104_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT104_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT104_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT104(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT104_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT104_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT105_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT105_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT105_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT105(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT105_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT105_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT106_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT106_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT106_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT106(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT106_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT106_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT107_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT107_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT107_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT107(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT107_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT107_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT108_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT108_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT108_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT108(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT108_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT108_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT109_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT109_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT109_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT109(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT109_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT109_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT110_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT110_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT110_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT110(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT110_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT110_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT111_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT111_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT111_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT111(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT111_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT111_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT112_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT112_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT112_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT112(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT112_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT112_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT113_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT113_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT113_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT113(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT113_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT113_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT114_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT114_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT114_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT114(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT114_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT114_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT115_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT115_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT115_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT115(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT115_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT115_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT116_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT116_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT116_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT116(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT116_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT116_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT117_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT117_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT117_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT117(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT117_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT117_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT118_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT118_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT118_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT118(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT118_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT118_MASK)

