zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT119_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT119_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT119_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT119(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT119_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT119_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT120_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT120_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT120_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT120(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT120_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT120_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT121_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT121_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT121_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT121(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT121_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT121_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT122_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT122_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT122_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT122(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT122_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT122_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT123_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT123_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT123_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT123(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT123_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT123_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT124_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT124_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT124_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT124(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT124_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT124_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT125_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT125_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT125_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT125(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT125_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT125_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT126_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT126_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT126_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT126(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT126_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT126_MASK)

#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT127_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT127_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT127_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCACTIVE_DCACT127(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCACTIVE_DCACT127_SHIFT)) & CANXL_GRP_CONTROL_DSCACTIVE_DCACT127_MASK)
/*! @} */

/*! @name FIFOCTRL - Message FIFO Control 1..Message FIFO Control 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1_MASK (0xFU)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1_SHIFT (0U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH1_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1_MASK (0xF00U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1_SHIFT (8U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM1_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2_MASK (0xF0000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2_SHIFT (16U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH2_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2_MASK (0xF000000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2_SHIFT (24U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM2_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3_MASK (0xFU)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3_SHIFT (0U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH3_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3_MASK (0xF00U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3_SHIFT (8U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM3_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4_MASK (0xF0000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4_SHIFT (16U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH4_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4_MASK (0xF000000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4_SHIFT (24U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM4_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5_MASK (0xFU)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5_SHIFT (0U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH5_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5_MASK (0xF00U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5_SHIFT (8U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM5_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6_MASK (0xF0000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6_SHIFT (16U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH6_MASK)

