zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6_MASK (0xF000000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6_SHIFT (24U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM6_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7_MASK (0xFU)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7_SHIFT (0U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH7_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7_MASK (0xF00U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7_SHIFT (8U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM7_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8_MASK (0xF0000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8_SHIFT (16U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFODPH8_MASK)

#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8_MASK (0xF000000U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8_SHIFT (24U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8_WIDTH (4U)
#define CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8_SHIFT)) & CANXL_GRP_CONTROL_FIFOCTRL_FIFOWTM8_MASK)
/*! @} */

/*! @name MSGIFLAG - Message Interrupt FLAG 1..Message Interrupt FLAG 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG0_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG1_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG2_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG3_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG4_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG5_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG6_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG7_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG8_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG9_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG10_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG11_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG12_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG13_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG14_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG15_MASK)

