zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG16_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG17_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG18_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG19_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG20_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG21_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG22_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG23_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG24_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG25_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG26_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG27_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG28_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG29_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG30_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG31_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG32_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG33_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG34_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG35_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG36_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG37_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG38_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG39_MASK)

