zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG40_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG41_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG42_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG43_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG44_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG45_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG46_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG47_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG48_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG49_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG50_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG51_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG52_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG53_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG54_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG55_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG56_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG57_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG58_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG59_MASK)

