zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG60_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG61_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG62_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG63_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG64_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG65_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG66_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG67_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG68_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG69_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG70_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG71_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG72_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG73_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG74_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG75_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG76_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG77_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG78_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG79_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG80_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG81_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG82_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG83_MASK)

