zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG84_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG85_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG86_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG87_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG88_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG89_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG90_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG91_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG92_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG93_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG94_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG95_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG96_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG97_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG98_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG99_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG100_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG101_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG102_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG103_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG104_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG105_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG106_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG107_MASK)

