zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG108_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG109_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG110_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG111_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG112_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG113_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG114_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG115_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG116_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG117_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG118_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG119_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG120_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG121_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG122_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG123_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG124_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG125_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG126_MASK)

#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127_SHIFT)) & CANXL_GRP_CONTROL_MSGIFLAG_MSGFLAG127_MASK)
/*! @} */

/*! @name MSGIMASK - Message Interrupt Mask 1..Message Interrupt Mask 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0_MASK  (0x1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM0_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1_MASK  (0x2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM1_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2_MASK  (0x4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM2_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3_MASK  (0x8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM3_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4_MASK  (0x10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM4_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5_MASK  (0x20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM5_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6_MASK  (0x40U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM6_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7_MASK  (0x80U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM7_MASK)

