zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8_MASK  (0x100U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM8_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9_MASK  (0x200U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM9_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM10_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM11_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM12_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM13_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM14_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM15_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM16_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM17_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM18_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM19_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM20_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM21_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM22_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM23_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM24_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM25_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM26_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM27_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM28_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM29_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM30_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM31_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM32_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM33_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM34_MASK)

