zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM35_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM36_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM37_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM38_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM39_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM40_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM41_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM42_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM43_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM44_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM45_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM46_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM47_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM48_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM49_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM50_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM51_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM52_MASK)

