zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM53_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM54_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM55_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM56_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM57_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM58_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM59_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM60_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM61_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM62_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM63_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM64_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM65_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM66_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM67_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM68_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM69_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM70_MASK)

