zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM71_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM72_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM73_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM74_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM75_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM76_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM77_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM78_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM79_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM80_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM81_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM82_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM83_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM84_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM85_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM86_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM87_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM88_MASK)

