zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM89_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM90_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM91_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM92_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM93_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM94_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM95_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96_MASK (0x1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96_SHIFT (0U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM96_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97_MASK (0x2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97_SHIFT (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM97_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98_MASK (0x4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98_SHIFT (2U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM98_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99_MASK (0x8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99_SHIFT (3U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM99_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100_MASK (0x10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100_SHIFT (4U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM100_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101_MASK (0x20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101_SHIFT (5U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM101_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102_MASK (0x40U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102_SHIFT (6U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM102_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103_MASK (0x80U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103_SHIFT (7U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM103_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104_MASK (0x100U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104_SHIFT (8U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM104_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105_MASK (0x200U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105_SHIFT (9U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM105_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106_MASK (0x400U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106_SHIFT (10U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM106_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107_MASK (0x800U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107_SHIFT (11U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM107_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108_MASK (0x1000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108_SHIFT (12U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM108_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109_MASK (0x2000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109_SHIFT (13U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM109_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110_MASK (0x4000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110_SHIFT (14U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM110_MASK)

