zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111_MASK (0x8000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111_SHIFT (15U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM111_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112_MASK (0x10000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112_SHIFT (16U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM112_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113_MASK (0x20000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113_SHIFT (17U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM113_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114_MASK (0x40000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114_SHIFT (18U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM114_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115_MASK (0x80000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115_SHIFT (19U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM115_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116_MASK (0x100000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116_SHIFT (20U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM116_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117_MASK (0x200000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117_SHIFT (21U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM117_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118_MASK (0x400000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118_SHIFT (22U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM118_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119_MASK (0x800000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119_SHIFT (23U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM119_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120_SHIFT (24U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM120_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121_SHIFT (25U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM121_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122_SHIFT (26U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM122_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123_SHIFT (27U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM123_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124_SHIFT (28U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM124_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125_SHIFT (29U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM125_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126_SHIFT (30U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM126_MASK)

#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127_SHIFT (31U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127_WIDTH (1U)
#define CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127_SHIFT)) & CANXL_GRP_CONTROL_MSGIMASK_MSGDIM127_MASK)
/*! @} */

/*! @name FREEDSC0 - Free Descriptor Index 0 */
/*! @{ */

#define CANXL_GRP_CONTROL_FREEDSC0_TMWMRK_MASK   (0xFU)
#define CANXL_GRP_CONTROL_FREEDSC0_TMWMRK_SHIFT  (0U)
#define CANXL_GRP_CONTROL_FREEDSC0_TMWMRK_WIDTH  (4U)
#define CANXL_GRP_CONTROL_FREEDSC0_TMWMRK(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FREEDSC0_TMWMRK_SHIFT)) & CANXL_GRP_CONTROL_FREEDSC0_TMWMRK_MASK)
/*! @} */

/*! @name FRMD - Free to Receive Message Descriptor 1..Free to Receive Message Descriptor 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_FRMD_MD0_MASK          (0x1U)
#define CANXL_GRP_CONTROL_FRMD_MD0_SHIFT         (0U)
#define CANXL_GRP_CONTROL_FRMD_MD0_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD0(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD0_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD0_MASK)

