zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD1_MASK          (0x2U)
#define CANXL_GRP_CONTROL_FRMD_MD1_SHIFT         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD1_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD1(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD1_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD1_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD2_MASK          (0x4U)
#define CANXL_GRP_CONTROL_FRMD_MD2_SHIFT         (2U)
#define CANXL_GRP_CONTROL_FRMD_MD2_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD2(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD2_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD2_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD3_MASK          (0x8U)
#define CANXL_GRP_CONTROL_FRMD_MD3_SHIFT         (3U)
#define CANXL_GRP_CONTROL_FRMD_MD3_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD3(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD3_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD3_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD4_MASK          (0x10U)
#define CANXL_GRP_CONTROL_FRMD_MD4_SHIFT         (4U)
#define CANXL_GRP_CONTROL_FRMD_MD4_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD4(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD4_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD4_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD5_MASK          (0x20U)
#define CANXL_GRP_CONTROL_FRMD_MD5_SHIFT         (5U)
#define CANXL_GRP_CONTROL_FRMD_MD5_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD5(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD5_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD5_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD6_MASK          (0x40U)
#define CANXL_GRP_CONTROL_FRMD_MD6_SHIFT         (6U)
#define CANXL_GRP_CONTROL_FRMD_MD6_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD6(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD6_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD6_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD7_MASK          (0x80U)
#define CANXL_GRP_CONTROL_FRMD_MD7_SHIFT         (7U)
#define CANXL_GRP_CONTROL_FRMD_MD7_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD7(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD7_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD7_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD8_MASK          (0x100U)
#define CANXL_GRP_CONTROL_FRMD_MD8_SHIFT         (8U)
#define CANXL_GRP_CONTROL_FRMD_MD8_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD8(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD8_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD8_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD9_MASK          (0x200U)
#define CANXL_GRP_CONTROL_FRMD_MD9_SHIFT         (9U)
#define CANXL_GRP_CONTROL_FRMD_MD9_WIDTH         (1U)
#define CANXL_GRP_CONTROL_FRMD_MD9(x)            (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD9_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD9_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD10_MASK         (0x400U)
#define CANXL_GRP_CONTROL_FRMD_MD10_SHIFT        (10U)
#define CANXL_GRP_CONTROL_FRMD_MD10_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD10(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD10_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD10_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD11_MASK         (0x800U)
#define CANXL_GRP_CONTROL_FRMD_MD11_SHIFT        (11U)
#define CANXL_GRP_CONTROL_FRMD_MD11_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD11(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD11_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD11_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD12_MASK         (0x1000U)
#define CANXL_GRP_CONTROL_FRMD_MD12_SHIFT        (12U)
#define CANXL_GRP_CONTROL_FRMD_MD12_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD12(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD12_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD12_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD13_MASK         (0x2000U)
#define CANXL_GRP_CONTROL_FRMD_MD13_SHIFT        (13U)
#define CANXL_GRP_CONTROL_FRMD_MD13_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD13(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD13_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD13_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD14_MASK         (0x4000U)
#define CANXL_GRP_CONTROL_FRMD_MD14_SHIFT        (14U)
#define CANXL_GRP_CONTROL_FRMD_MD14_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD14(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD14_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD14_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD15_MASK         (0x8000U)
#define CANXL_GRP_CONTROL_FRMD_MD15_SHIFT        (15U)
#define CANXL_GRP_CONTROL_FRMD_MD15_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD15(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD15_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD15_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD16_MASK         (0x10000U)
#define CANXL_GRP_CONTROL_FRMD_MD16_SHIFT        (16U)
#define CANXL_GRP_CONTROL_FRMD_MD16_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD16(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD16_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD16_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD17_MASK         (0x20000U)
#define CANXL_GRP_CONTROL_FRMD_MD17_SHIFT        (17U)
#define CANXL_GRP_CONTROL_FRMD_MD17_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD17(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD17_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD17_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD18_MASK         (0x40000U)
#define CANXL_GRP_CONTROL_FRMD_MD18_SHIFT        (18U)
#define CANXL_GRP_CONTROL_FRMD_MD18_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD18(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD18_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD18_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD19_MASK         (0x80000U)
#define CANXL_GRP_CONTROL_FRMD_MD19_SHIFT        (19U)
#define CANXL_GRP_CONTROL_FRMD_MD19_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD19(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD19_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD19_MASK)

