zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD20_MASK         (0x100000U)
#define CANXL_GRP_CONTROL_FRMD_MD20_SHIFT        (20U)
#define CANXL_GRP_CONTROL_FRMD_MD20_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD20(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD20_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD20_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD21_MASK         (0x200000U)
#define CANXL_GRP_CONTROL_FRMD_MD21_SHIFT        (21U)
#define CANXL_GRP_CONTROL_FRMD_MD21_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD21(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD21_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD21_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD22_MASK         (0x400000U)
#define CANXL_GRP_CONTROL_FRMD_MD22_SHIFT        (22U)
#define CANXL_GRP_CONTROL_FRMD_MD22_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD22(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD22_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD22_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD23_MASK         (0x800000U)
#define CANXL_GRP_CONTROL_FRMD_MD23_SHIFT        (23U)
#define CANXL_GRP_CONTROL_FRMD_MD23_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD23(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD23_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD23_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD24_MASK         (0x1000000U)
#define CANXL_GRP_CONTROL_FRMD_MD24_SHIFT        (24U)
#define CANXL_GRP_CONTROL_FRMD_MD24_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD24(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD24_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD24_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD25_MASK         (0x2000000U)
#define CANXL_GRP_CONTROL_FRMD_MD25_SHIFT        (25U)
#define CANXL_GRP_CONTROL_FRMD_MD25_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD25(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD25_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD25_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD26_MASK         (0x4000000U)
#define CANXL_GRP_CONTROL_FRMD_MD26_SHIFT        (26U)
#define CANXL_GRP_CONTROL_FRMD_MD26_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD26(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD26_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD26_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD27_MASK         (0x8000000U)
#define CANXL_GRP_CONTROL_FRMD_MD27_SHIFT        (27U)
#define CANXL_GRP_CONTROL_FRMD_MD27_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD27(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD27_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD27_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD28_MASK         (0x10000000U)
#define CANXL_GRP_CONTROL_FRMD_MD28_SHIFT        (28U)
#define CANXL_GRP_CONTROL_FRMD_MD28_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD28(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD28_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD28_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD29_MASK         (0x20000000U)
#define CANXL_GRP_CONTROL_FRMD_MD29_SHIFT        (29U)
#define CANXL_GRP_CONTROL_FRMD_MD29_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD29(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD29_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD29_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD30_MASK         (0x40000000U)
#define CANXL_GRP_CONTROL_FRMD_MD30_SHIFT        (30U)
#define CANXL_GRP_CONTROL_FRMD_MD30_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD30(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD30_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD30_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD31_MASK         (0x80000000U)
#define CANXL_GRP_CONTROL_FRMD_MD31_SHIFT        (31U)
#define CANXL_GRP_CONTROL_FRMD_MD31_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD31(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD31_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD31_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD32_MASK         (0x1U)
#define CANXL_GRP_CONTROL_FRMD_MD32_SHIFT        (0U)
#define CANXL_GRP_CONTROL_FRMD_MD32_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD32(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD32_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD32_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD33_MASK         (0x2U)
#define CANXL_GRP_CONTROL_FRMD_MD33_SHIFT        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD33_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD33(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD33_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD33_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD34_MASK         (0x4U)
#define CANXL_GRP_CONTROL_FRMD_MD34_SHIFT        (2U)
#define CANXL_GRP_CONTROL_FRMD_MD34_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD34(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD34_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD34_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD35_MASK         (0x8U)
#define CANXL_GRP_CONTROL_FRMD_MD35_SHIFT        (3U)
#define CANXL_GRP_CONTROL_FRMD_MD35_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD35(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD35_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD35_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD36_MASK         (0x10U)
#define CANXL_GRP_CONTROL_FRMD_MD36_SHIFT        (4U)
#define CANXL_GRP_CONTROL_FRMD_MD36_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD36(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD36_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD36_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD37_MASK         (0x20U)
#define CANXL_GRP_CONTROL_FRMD_MD37_SHIFT        (5U)
#define CANXL_GRP_CONTROL_FRMD_MD37_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD37(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD37_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD37_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD38_MASK         (0x40U)
#define CANXL_GRP_CONTROL_FRMD_MD38_SHIFT        (6U)
#define CANXL_GRP_CONTROL_FRMD_MD38_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD38(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD38_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD38_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD39_MASK         (0x80U)
#define CANXL_GRP_CONTROL_FRMD_MD39_SHIFT        (7U)
#define CANXL_GRP_CONTROL_FRMD_MD39_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD39(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD39_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD39_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD40_MASK         (0x100U)
#define CANXL_GRP_CONTROL_FRMD_MD40_SHIFT        (8U)
#define CANXL_GRP_CONTROL_FRMD_MD40_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD40(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD40_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD40_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD41_MASK         (0x200U)
#define CANXL_GRP_CONTROL_FRMD_MD41_SHIFT        (9U)
#define CANXL_GRP_CONTROL_FRMD_MD41_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD41(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD41_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD41_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD42_MASK         (0x400U)
#define CANXL_GRP_CONTROL_FRMD_MD42_SHIFT        (10U)
#define CANXL_GRP_CONTROL_FRMD_MD42_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD42(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD42_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD42_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD43_MASK         (0x800U)
#define CANXL_GRP_CONTROL_FRMD_MD43_SHIFT        (11U)
#define CANXL_GRP_CONTROL_FRMD_MD43_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD43(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD43_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD43_MASK)

