zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD44_MASK         (0x1000U)
#define CANXL_GRP_CONTROL_FRMD_MD44_SHIFT        (12U)
#define CANXL_GRP_CONTROL_FRMD_MD44_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD44(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD44_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD44_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD45_MASK         (0x2000U)
#define CANXL_GRP_CONTROL_FRMD_MD45_SHIFT        (13U)
#define CANXL_GRP_CONTROL_FRMD_MD45_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD45(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD45_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD45_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD46_MASK         (0x4000U)
#define CANXL_GRP_CONTROL_FRMD_MD46_SHIFT        (14U)
#define CANXL_GRP_CONTROL_FRMD_MD46_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD46(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD46_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD46_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD47_MASK         (0x8000U)
#define CANXL_GRP_CONTROL_FRMD_MD47_SHIFT        (15U)
#define CANXL_GRP_CONTROL_FRMD_MD47_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD47(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD47_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD47_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD48_MASK         (0x10000U)
#define CANXL_GRP_CONTROL_FRMD_MD48_SHIFT        (16U)
#define CANXL_GRP_CONTROL_FRMD_MD48_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD48(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD48_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD48_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD49_MASK         (0x20000U)
#define CANXL_GRP_CONTROL_FRMD_MD49_SHIFT        (17U)
#define CANXL_GRP_CONTROL_FRMD_MD49_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD49(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD49_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD49_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD50_MASK         (0x40000U)
#define CANXL_GRP_CONTROL_FRMD_MD50_SHIFT        (18U)
#define CANXL_GRP_CONTROL_FRMD_MD50_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD50(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD50_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD50_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD51_MASK         (0x80000U)
#define CANXL_GRP_CONTROL_FRMD_MD51_SHIFT        (19U)
#define CANXL_GRP_CONTROL_FRMD_MD51_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD51(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD51_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD51_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD52_MASK         (0x100000U)
#define CANXL_GRP_CONTROL_FRMD_MD52_SHIFT        (20U)
#define CANXL_GRP_CONTROL_FRMD_MD52_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD52(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD52_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD52_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD53_MASK         (0x200000U)
#define CANXL_GRP_CONTROL_FRMD_MD53_SHIFT        (21U)
#define CANXL_GRP_CONTROL_FRMD_MD53_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD53(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD53_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD53_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD54_MASK         (0x400000U)
#define CANXL_GRP_CONTROL_FRMD_MD54_SHIFT        (22U)
#define CANXL_GRP_CONTROL_FRMD_MD54_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD54(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD54_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD54_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD55_MASK         (0x800000U)
#define CANXL_GRP_CONTROL_FRMD_MD55_SHIFT        (23U)
#define CANXL_GRP_CONTROL_FRMD_MD55_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD55(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD55_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD55_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD56_MASK         (0x1000000U)
#define CANXL_GRP_CONTROL_FRMD_MD56_SHIFT        (24U)
#define CANXL_GRP_CONTROL_FRMD_MD56_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD56(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD56_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD56_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD57_MASK         (0x2000000U)
#define CANXL_GRP_CONTROL_FRMD_MD57_SHIFT        (25U)
#define CANXL_GRP_CONTROL_FRMD_MD57_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD57(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD57_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD57_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD58_MASK         (0x4000000U)
#define CANXL_GRP_CONTROL_FRMD_MD58_SHIFT        (26U)
#define CANXL_GRP_CONTROL_FRMD_MD58_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD58(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD58_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD58_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD59_MASK         (0x8000000U)
#define CANXL_GRP_CONTROL_FRMD_MD59_SHIFT        (27U)
#define CANXL_GRP_CONTROL_FRMD_MD59_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD59(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD59_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD59_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD60_MASK         (0x10000000U)
#define CANXL_GRP_CONTROL_FRMD_MD60_SHIFT        (28U)
#define CANXL_GRP_CONTROL_FRMD_MD60_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD60(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD60_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD60_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD61_MASK         (0x20000000U)
#define CANXL_GRP_CONTROL_FRMD_MD61_SHIFT        (29U)
#define CANXL_GRP_CONTROL_FRMD_MD61_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD61(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD61_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD61_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD62_MASK         (0x40000000U)
#define CANXL_GRP_CONTROL_FRMD_MD62_SHIFT        (30U)
#define CANXL_GRP_CONTROL_FRMD_MD62_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD62(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD62_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD62_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD63_MASK         (0x80000000U)
#define CANXL_GRP_CONTROL_FRMD_MD63_SHIFT        (31U)
#define CANXL_GRP_CONTROL_FRMD_MD63_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD63(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD63_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD63_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD64_MASK         (0x1U)
#define CANXL_GRP_CONTROL_FRMD_MD64_SHIFT        (0U)
#define CANXL_GRP_CONTROL_FRMD_MD64_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD64(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD64_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD64_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD65_MASK         (0x2U)
#define CANXL_GRP_CONTROL_FRMD_MD65_SHIFT        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD65_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD65(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD65_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD65_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD66_MASK         (0x4U)
#define CANXL_GRP_CONTROL_FRMD_MD66_SHIFT        (2U)
#define CANXL_GRP_CONTROL_FRMD_MD66_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD66(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD66_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD66_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD67_MASK         (0x8U)
#define CANXL_GRP_CONTROL_FRMD_MD67_SHIFT        (3U)
#define CANXL_GRP_CONTROL_FRMD_MD67_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD67(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD67_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD67_MASK)

