zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD68_MASK         (0x10U)
#define CANXL_GRP_CONTROL_FRMD_MD68_SHIFT        (4U)
#define CANXL_GRP_CONTROL_FRMD_MD68_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD68(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD68_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD68_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD69_MASK         (0x20U)
#define CANXL_GRP_CONTROL_FRMD_MD69_SHIFT        (5U)
#define CANXL_GRP_CONTROL_FRMD_MD69_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD69(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD69_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD69_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD70_MASK         (0x40U)
#define CANXL_GRP_CONTROL_FRMD_MD70_SHIFT        (6U)
#define CANXL_GRP_CONTROL_FRMD_MD70_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD70(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD70_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD70_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD71_MASK         (0x80U)
#define CANXL_GRP_CONTROL_FRMD_MD71_SHIFT        (7U)
#define CANXL_GRP_CONTROL_FRMD_MD71_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD71(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD71_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD71_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD72_MASK         (0x100U)
#define CANXL_GRP_CONTROL_FRMD_MD72_SHIFT        (8U)
#define CANXL_GRP_CONTROL_FRMD_MD72_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD72(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD72_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD72_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD73_MASK         (0x200U)
#define CANXL_GRP_CONTROL_FRMD_MD73_SHIFT        (9U)
#define CANXL_GRP_CONTROL_FRMD_MD73_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD73(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD73_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD73_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD74_MASK         (0x400U)
#define CANXL_GRP_CONTROL_FRMD_MD74_SHIFT        (10U)
#define CANXL_GRP_CONTROL_FRMD_MD74_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD74(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD74_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD74_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD75_MASK         (0x800U)
#define CANXL_GRP_CONTROL_FRMD_MD75_SHIFT        (11U)
#define CANXL_GRP_CONTROL_FRMD_MD75_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD75(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD75_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD75_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD76_MASK         (0x1000U)
#define CANXL_GRP_CONTROL_FRMD_MD76_SHIFT        (12U)
#define CANXL_GRP_CONTROL_FRMD_MD76_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD76(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD76_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD76_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD77_MASK         (0x2000U)
#define CANXL_GRP_CONTROL_FRMD_MD77_SHIFT        (13U)
#define CANXL_GRP_CONTROL_FRMD_MD77_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD77(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD77_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD77_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD78_MASK         (0x4000U)
#define CANXL_GRP_CONTROL_FRMD_MD78_SHIFT        (14U)
#define CANXL_GRP_CONTROL_FRMD_MD78_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD78(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD78_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD78_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD79_MASK         (0x8000U)
#define CANXL_GRP_CONTROL_FRMD_MD79_SHIFT        (15U)
#define CANXL_GRP_CONTROL_FRMD_MD79_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD79(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD79_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD79_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD80_MASK         (0x10000U)
#define CANXL_GRP_CONTROL_FRMD_MD80_SHIFT        (16U)
#define CANXL_GRP_CONTROL_FRMD_MD80_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD80(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD80_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD80_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD81_MASK         (0x20000U)
#define CANXL_GRP_CONTROL_FRMD_MD81_SHIFT        (17U)
#define CANXL_GRP_CONTROL_FRMD_MD81_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD81(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD81_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD81_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD82_MASK         (0x40000U)
#define CANXL_GRP_CONTROL_FRMD_MD82_SHIFT        (18U)
#define CANXL_GRP_CONTROL_FRMD_MD82_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD82(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD82_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD82_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD83_MASK         (0x80000U)
#define CANXL_GRP_CONTROL_FRMD_MD83_SHIFT        (19U)
#define CANXL_GRP_CONTROL_FRMD_MD83_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD83(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD83_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD83_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD84_MASK         (0x100000U)
#define CANXL_GRP_CONTROL_FRMD_MD84_SHIFT        (20U)
#define CANXL_GRP_CONTROL_FRMD_MD84_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD84(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD84_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD84_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD85_MASK         (0x200000U)
#define CANXL_GRP_CONTROL_FRMD_MD85_SHIFT        (21U)
#define CANXL_GRP_CONTROL_FRMD_MD85_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD85(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD85_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD85_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD86_MASK         (0x400000U)
#define CANXL_GRP_CONTROL_FRMD_MD86_SHIFT        (22U)
#define CANXL_GRP_CONTROL_FRMD_MD86_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD86(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD86_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD86_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD87_MASK         (0x800000U)
#define CANXL_GRP_CONTROL_FRMD_MD87_SHIFT        (23U)
#define CANXL_GRP_CONTROL_FRMD_MD87_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD87(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD87_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD87_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD88_MASK         (0x1000000U)
#define CANXL_GRP_CONTROL_FRMD_MD88_SHIFT        (24U)
#define CANXL_GRP_CONTROL_FRMD_MD88_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD88(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD88_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD88_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD89_MASK         (0x2000000U)
#define CANXL_GRP_CONTROL_FRMD_MD89_SHIFT        (25U)
#define CANXL_GRP_CONTROL_FRMD_MD89_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD89(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD89_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD89_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD90_MASK         (0x4000000U)
#define CANXL_GRP_CONTROL_FRMD_MD90_SHIFT        (26U)
#define CANXL_GRP_CONTROL_FRMD_MD90_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD90(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD90_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD90_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD91_MASK         (0x8000000U)
#define CANXL_GRP_CONTROL_FRMD_MD91_SHIFT        (27U)
#define CANXL_GRP_CONTROL_FRMD_MD91_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD91(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD91_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD91_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD92_MASK         (0x10000000U)
#define CANXL_GRP_CONTROL_FRMD_MD92_SHIFT        (28U)
#define CANXL_GRP_CONTROL_FRMD_MD92_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD92(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD92_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD92_MASK)

