zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD93_MASK         (0x20000000U)
#define CANXL_GRP_CONTROL_FRMD_MD93_SHIFT        (29U)
#define CANXL_GRP_CONTROL_FRMD_MD93_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD93(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD93_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD93_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD94_MASK         (0x40000000U)
#define CANXL_GRP_CONTROL_FRMD_MD94_SHIFT        (30U)
#define CANXL_GRP_CONTROL_FRMD_MD94_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD94(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD94_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD94_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD95_MASK         (0x80000000U)
#define CANXL_GRP_CONTROL_FRMD_MD95_SHIFT        (31U)
#define CANXL_GRP_CONTROL_FRMD_MD95_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD95(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD95_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD95_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD96_MASK         (0x1U)
#define CANXL_GRP_CONTROL_FRMD_MD96_SHIFT        (0U)
#define CANXL_GRP_CONTROL_FRMD_MD96_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD96(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD96_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD96_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD97_MASK         (0x2U)
#define CANXL_GRP_CONTROL_FRMD_MD97_SHIFT        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD97_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD97(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD97_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD97_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD98_MASK         (0x4U)
#define CANXL_GRP_CONTROL_FRMD_MD98_SHIFT        (2U)
#define CANXL_GRP_CONTROL_FRMD_MD98_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD98(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD98_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD98_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD99_MASK         (0x8U)
#define CANXL_GRP_CONTROL_FRMD_MD99_SHIFT        (3U)
#define CANXL_GRP_CONTROL_FRMD_MD99_WIDTH        (1U)
#define CANXL_GRP_CONTROL_FRMD_MD99(x)           (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD99_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD99_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD100_MASK        (0x10U)
#define CANXL_GRP_CONTROL_FRMD_MD100_SHIFT       (4U)
#define CANXL_GRP_CONTROL_FRMD_MD100_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD100(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD100_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD100_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD101_MASK        (0x20U)
#define CANXL_GRP_CONTROL_FRMD_MD101_SHIFT       (5U)
#define CANXL_GRP_CONTROL_FRMD_MD101_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD101(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD101_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD101_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD102_MASK        (0x40U)
#define CANXL_GRP_CONTROL_FRMD_MD102_SHIFT       (6U)
#define CANXL_GRP_CONTROL_FRMD_MD102_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD102(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD102_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD102_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD103_MASK        (0x80U)
#define CANXL_GRP_CONTROL_FRMD_MD103_SHIFT       (7U)
#define CANXL_GRP_CONTROL_FRMD_MD103_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD103(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD103_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD103_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD104_MASK        (0x100U)
#define CANXL_GRP_CONTROL_FRMD_MD104_SHIFT       (8U)
#define CANXL_GRP_CONTROL_FRMD_MD104_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD104(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD104_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD104_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD105_MASK        (0x200U)
#define CANXL_GRP_CONTROL_FRMD_MD105_SHIFT       (9U)
#define CANXL_GRP_CONTROL_FRMD_MD105_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD105(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD105_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD105_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD106_MASK        (0x400U)
#define CANXL_GRP_CONTROL_FRMD_MD106_SHIFT       (10U)
#define CANXL_GRP_CONTROL_FRMD_MD106_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD106(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD106_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD106_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD107_MASK        (0x800U)
#define CANXL_GRP_CONTROL_FRMD_MD107_SHIFT       (11U)
#define CANXL_GRP_CONTROL_FRMD_MD107_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD107(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD107_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD107_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD108_MASK        (0x1000U)
#define CANXL_GRP_CONTROL_FRMD_MD108_SHIFT       (12U)
#define CANXL_GRP_CONTROL_FRMD_MD108_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD108(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD108_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD108_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD109_MASK        (0x2000U)
#define CANXL_GRP_CONTROL_FRMD_MD109_SHIFT       (13U)
#define CANXL_GRP_CONTROL_FRMD_MD109_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD109(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD109_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD109_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD110_MASK        (0x4000U)
#define CANXL_GRP_CONTROL_FRMD_MD110_SHIFT       (14U)
#define CANXL_GRP_CONTROL_FRMD_MD110_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD110(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD110_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD110_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD111_MASK        (0x8000U)
#define CANXL_GRP_CONTROL_FRMD_MD111_SHIFT       (15U)
#define CANXL_GRP_CONTROL_FRMD_MD111_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD111(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD111_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD111_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD112_MASK        (0x10000U)
#define CANXL_GRP_CONTROL_FRMD_MD112_SHIFT       (16U)
#define CANXL_GRP_CONTROL_FRMD_MD112_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD112(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD112_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD112_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD113_MASK        (0x20000U)
#define CANXL_GRP_CONTROL_FRMD_MD113_SHIFT       (17U)
#define CANXL_GRP_CONTROL_FRMD_MD113_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD113(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD113_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD113_MASK)

