zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_FRMD_MD114_MASK        (0x40000U)
#define CANXL_GRP_CONTROL_FRMD_MD114_SHIFT       (18U)
#define CANXL_GRP_CONTROL_FRMD_MD114_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD114(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD114_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD114_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD115_MASK        (0x80000U)
#define CANXL_GRP_CONTROL_FRMD_MD115_SHIFT       (19U)
#define CANXL_GRP_CONTROL_FRMD_MD115_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD115(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD115_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD115_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD116_MASK        (0x100000U)
#define CANXL_GRP_CONTROL_FRMD_MD116_SHIFT       (20U)
#define CANXL_GRP_CONTROL_FRMD_MD116_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD116(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD116_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD116_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD117_MASK        (0x200000U)
#define CANXL_GRP_CONTROL_FRMD_MD117_SHIFT       (21U)
#define CANXL_GRP_CONTROL_FRMD_MD117_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD117(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD117_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD117_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD118_MASK        (0x400000U)
#define CANXL_GRP_CONTROL_FRMD_MD118_SHIFT       (22U)
#define CANXL_GRP_CONTROL_FRMD_MD118_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD118(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD118_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD118_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD119_MASK        (0x800000U)
#define CANXL_GRP_CONTROL_FRMD_MD119_SHIFT       (23U)
#define CANXL_GRP_CONTROL_FRMD_MD119_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD119(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD119_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD119_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD120_MASK        (0x1000000U)
#define CANXL_GRP_CONTROL_FRMD_MD120_SHIFT       (24U)
#define CANXL_GRP_CONTROL_FRMD_MD120_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD120(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD120_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD120_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD121_MASK        (0x2000000U)
#define CANXL_GRP_CONTROL_FRMD_MD121_SHIFT       (25U)
#define CANXL_GRP_CONTROL_FRMD_MD121_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD121(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD121_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD121_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD122_MASK        (0x4000000U)
#define CANXL_GRP_CONTROL_FRMD_MD122_SHIFT       (26U)
#define CANXL_GRP_CONTROL_FRMD_MD122_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD122(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD122_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD122_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD123_MASK        (0x8000000U)
#define CANXL_GRP_CONTROL_FRMD_MD123_SHIFT       (27U)
#define CANXL_GRP_CONTROL_FRMD_MD123_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD123(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD123_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD123_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD124_MASK        (0x10000000U)
#define CANXL_GRP_CONTROL_FRMD_MD124_SHIFT       (28U)
#define CANXL_GRP_CONTROL_FRMD_MD124_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD124(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD124_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD124_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD125_MASK        (0x20000000U)
#define CANXL_GRP_CONTROL_FRMD_MD125_SHIFT       (29U)
#define CANXL_GRP_CONTROL_FRMD_MD125_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD125(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD125_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD125_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD126_MASK        (0x40000000U)
#define CANXL_GRP_CONTROL_FRMD_MD126_SHIFT       (30U)
#define CANXL_GRP_CONTROL_FRMD_MD126_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD126(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD126_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD126_MASK)

#define CANXL_GRP_CONTROL_FRMD_MD127_MASK        (0x80000000U)
#define CANXL_GRP_CONTROL_FRMD_MD127_SHIFT       (31U)
#define CANXL_GRP_CONTROL_FRMD_MD127_WIDTH       (1U)
#define CANXL_GRP_CONTROL_FRMD_MD127(x)          (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_FRMD_MD127_SHIFT)) & CANXL_GRP_CONTROL_FRMD_MD127_MASK)
/*! @} */

/*! @name DSCABTPND - Descriptor Abort Request Pending Status 1..Descriptor Abort Request Pending Status 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND0_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND0_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND0_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND0(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND0_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND0_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND1_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND1_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND1_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND1(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND1_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND1_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND2_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND2_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND2_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND2(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND2_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND2_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND3_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND3_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND3_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND3(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND3_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND3_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND4_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND4_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND4_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND4(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND4_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND4_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND5_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND5_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND5_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND5(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND5_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND5_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND6_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND6_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND6_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND6(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND6_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND6_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND7_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND7_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND7_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND7(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND7_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND7_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND8_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND8_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND8_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND8(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND8_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND8_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND9_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND9_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND9_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND9(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND9_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND9_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND10_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND10_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND10_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND10(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND10_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND10_MASK)

