zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND11_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND11_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND11_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND11(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND11_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND11_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND12_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND12_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND12_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND12(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND12_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND12_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND13_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND13_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND13_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND13(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND13_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND13_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND14_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND14_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND14_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND14(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND14_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND14_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND15_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND15_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND15_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND15(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND15_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND15_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND16_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND16_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND16_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND16(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND16_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND16_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND17_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND17_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND17_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND17(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND17_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND17_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND18_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND18_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND18_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND18(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND18_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND18_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND19_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND19_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND19_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND19(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND19_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND19_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND20_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND20_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND20_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND20(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND20_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND20_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND21_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND21_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND21_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND21(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND21_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND21_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND22_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND22_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND22_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND22(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND22_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND22_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND23_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND23_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND23_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND23(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND23_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND23_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND24_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND24_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND24_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND24(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND24_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND24_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND25_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND25_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND25_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND25(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND25_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND25_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND26_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND26_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND26_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND26(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND26_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND26_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND27_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND27_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND27_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND27(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND27_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND27_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND28_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND28_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND28_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND28(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND28_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND28_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND29_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND29_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND29_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND29(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND29_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND29_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND30_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND30_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND30_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND30(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND30_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND30_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND31_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND31_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND31_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND31(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND31_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND31_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND32_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND32_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND32_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND32(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND32_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND32_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND33_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND33_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND33_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND33(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND33_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND33_MASK)

