zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND34_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND34_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND34_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND34(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND34_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND34_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND35_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND35_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND35_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND35(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND35_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND35_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND36_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND36_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND36_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND36(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND36_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND36_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND37_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND37_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND37_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND37(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND37_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND37_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND38_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND38_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND38_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND38(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND38_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND38_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND39_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND39_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND39_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND39(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND39_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND39_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND40_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND40_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND40_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND40(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND40_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND40_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND41_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND41_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND41_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND41(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND41_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND41_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND42_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND42_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND42_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND42(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND42_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND42_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND43_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND43_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND43_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND43(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND43_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND43_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND44_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND44_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND44_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND44(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND44_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND44_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND45_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND45_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND45_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND45(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND45_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND45_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND46_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND46_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND46_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND46(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND46_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND46_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND47_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND47_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND47_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND47(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND47_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND47_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND48_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND48_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND48_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND48(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND48_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND48_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND49_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND49_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND49_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND49(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND49_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND49_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND50_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND50_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND50_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND50(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND50_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND50_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND51_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND51_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND51_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND51(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND51_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND51_MASK)

