zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND52_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND52_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND52_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND52(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND52_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND52_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND53_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND53_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND53_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND53(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND53_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND53_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND54_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND54_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND54_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND54(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND54_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND54_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND55_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND55_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND55_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND55(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND55_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND55_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND56_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND56_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND56_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND56(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND56_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND56_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND57_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND57_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND57_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND57(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND57_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND57_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND58_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND58_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND58_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND58(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND58_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND58_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND59_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND59_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND59_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND59(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND59_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND59_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND60_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND60_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND60_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND60(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND60_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND60_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND61_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND61_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND61_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND61(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND61_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND61_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND62_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND62_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND62_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND62(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND62_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND62_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND63_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND63_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND63_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND63(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND63_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND63_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND64_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND64_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND64_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND64(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND64_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND64_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND65_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND65_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND65_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND65(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND65_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND65_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND66_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND66_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND66_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND66(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND66_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND66_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND67_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND67_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND67_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND67(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND67_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND67_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND68_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND68_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND68_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND68(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND68_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND68_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND69_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND69_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND69_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND69(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND69_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND69_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND70_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND70_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND70_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND70(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND70_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND70_MASK)

