zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND71_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND71_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND71_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND71(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND71_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND71_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND72_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND72_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND72_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND72(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND72_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND72_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND73_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND73_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND73_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND73(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND73_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND73_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND74_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND74_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND74_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND74(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND74_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND74_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND75_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND75_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND75_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND75(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND75_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND75_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND76_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND76_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND76_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND76(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND76_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND76_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND77_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND77_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND77_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND77(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND77_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND77_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND78_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND78_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND78_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND78(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND78_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND78_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND79_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND79_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND79_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND79(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND79_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND79_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND80_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND80_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND80_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND80(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND80_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND80_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND81_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND81_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND81_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND81(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND81_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND81_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND82_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND82_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND82_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND82(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND82_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND82_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND83_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND83_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND83_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND83(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND83_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND83_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND84_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND84_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND84_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND84(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND84_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND84_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND85_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND85_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND85_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND85(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND85_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND85_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND86_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND86_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND86_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND86(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND86_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND86_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND87_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND87_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND87_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND87(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND87_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND87_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND88_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND88_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND88_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND88(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND88_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND88_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND89_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND89_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND89_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND89(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND89_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND89_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND90_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND90_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND90_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND90(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND90_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND90_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND91_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND91_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND91_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND91(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND91_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND91_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND92_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND92_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND92_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND92(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND92_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND92_MASK)

