zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND93_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND93_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND93_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND93(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND93_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND93_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND94_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND94_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND94_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND94(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND94_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND94_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND95_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND95_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND95_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND95(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND95_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND95_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND96_MASK (0x1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND96_SHIFT (0U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND96_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND96(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND96_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND96_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND97_MASK (0x2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND97_SHIFT (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND97_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND97(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND97_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND97_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND98_MASK (0x4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND98_SHIFT (2U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND98_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND98(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND98_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND98_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND99_MASK (0x8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND99_SHIFT (3U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND99_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND99(x)  (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND99_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND99_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND100_MASK (0x10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND100_SHIFT (4U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND100_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND100(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND100_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND100_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND101_MASK (0x20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND101_SHIFT (5U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND101_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND101(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND101_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND101_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND102_MASK (0x40U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND102_SHIFT (6U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND102_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND102(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND102_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND102_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND103_MASK (0x80U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND103_SHIFT (7U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND103_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND103(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND103_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND103_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND104_MASK (0x100U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND104_SHIFT (8U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND104_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND104(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND104_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND104_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND105_MASK (0x200U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND105_SHIFT (9U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND105_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND105(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND105_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND105_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND106_MASK (0x400U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND106_SHIFT (10U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND106_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND106(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND106_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND106_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND107_MASK (0x800U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND107_SHIFT (11U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND107_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND107(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND107_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND107_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND108_MASK (0x1000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND108_SHIFT (12U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND108_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND108(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND108_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND108_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND109_MASK (0x2000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND109_SHIFT (13U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND109_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND109(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND109_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND109_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND110_MASK (0x4000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND110_SHIFT (14U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND110_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND110(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND110_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND110_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND111_MASK (0x8000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND111_SHIFT (15U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND111_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND111(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND111_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND111_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND112_MASK (0x10000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND112_SHIFT (16U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND112_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND112(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND112_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND112_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND113_MASK (0x20000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND113_SHIFT (17U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND113_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND113(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND113_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND113_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND114_MASK (0x40000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND114_SHIFT (18U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND114_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND114(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND114_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND114_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND115_MASK (0x80000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND115_SHIFT (19U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND115_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND115(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND115_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND115_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND116_MASK (0x100000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND116_SHIFT (20U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND116_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND116(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND116_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND116_MASK)

