zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND117_MASK (0x200000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND117_SHIFT (21U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND117_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND117(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND117_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND117_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND118_MASK (0x400000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND118_SHIFT (22U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND118_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND118(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND118_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND118_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND119_MASK (0x800000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND119_SHIFT (23U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND119_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND119(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND119_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND119_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND120_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND120_SHIFT (24U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND120_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND120(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND120_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND120_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND121_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND121_SHIFT (25U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND121_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND121(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND121_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND121_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND122_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND122_SHIFT (26U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND122_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND122(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND122_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND122_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND123_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND123_SHIFT (27U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND123_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND123(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND123_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND123_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND124_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND124_SHIFT (28U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND124_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND124(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND124_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND124_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND125_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND125_SHIFT (29U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND125_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND125(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND125_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND125_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND126_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND126_SHIFT (30U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND126_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND126(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND126_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND126_MASK)

#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND127_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND127_SHIFT (31U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND127_WIDTH (1U)
#define CANXL_GRP_CONTROL_DSCABTPND_ABTPND127(x) (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_DSCABTPND_ABTPND127_SHIFT)) & CANXL_GRP_CONTROL_DSCABTPND_ABTPND127_MASK)
/*! @} */

/*! @name OVERRUNF - Descriptor Overrun Flag 1..Descriptor Overrun Flag 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF0_MASK   (0x1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF0_SHIFT  (0U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF0_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF0(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF0_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF0_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF1_MASK   (0x2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF1_SHIFT  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF1_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF1(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF1_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF1_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF2_MASK   (0x4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF2_SHIFT  (2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF2_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF2(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF2_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF2_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF3_MASK   (0x8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF3_SHIFT  (3U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF3_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF3(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF3_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF3_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF4_MASK   (0x10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF4_SHIFT  (4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF4_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF4(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF4_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF4_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF5_MASK   (0x20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF5_SHIFT  (5U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF5_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF5(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF5_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF5_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF6_MASK   (0x40U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF6_SHIFT  (6U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF6_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF6(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF6_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF6_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF7_MASK   (0x80U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF7_SHIFT  (7U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF7_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF7(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF7_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF7_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF8_MASK   (0x100U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF8_SHIFT  (8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF8_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF8(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF8_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF8_MASK)

