zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF9_MASK   (0x200U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF9_SHIFT  (9U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF9_WIDTH  (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF9(x)     (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF9_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF9_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF10_MASK  (0x400U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF10_SHIFT (10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF10_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF10(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF10_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF10_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF11_MASK  (0x800U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF11_SHIFT (11U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF11_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF11(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF11_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF11_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF12_MASK  (0x1000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF12_SHIFT (12U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF12_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF12(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF12_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF12_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF13_MASK  (0x2000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF13_SHIFT (13U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF13_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF13(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF13_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF13_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF14_MASK  (0x4000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF14_SHIFT (14U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF14_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF14(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF14_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF14_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF15_MASK  (0x8000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF15_SHIFT (15U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF15_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF15(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF15_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF15_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF16_MASK  (0x10000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF16_SHIFT (16U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF16_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF16(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF16_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF16_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF17_MASK  (0x20000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF17_SHIFT (17U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF17_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF17(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF17_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF17_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF18_MASK  (0x40000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF18_SHIFT (18U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF18_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF18(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF18_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF18_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF19_MASK  (0x80000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF19_SHIFT (19U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF19_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF19(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF19_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF19_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF20_MASK  (0x100000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF20_SHIFT (20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF20_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF20(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF20_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF20_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF21_MASK  (0x200000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF21_SHIFT (21U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF21_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF21(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF21_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF21_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF22_MASK  (0x400000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF22_SHIFT (22U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF22_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF22(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF22_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF22_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF23_MASK  (0x800000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF23_SHIFT (23U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF23_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF23(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF23_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF23_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF24_MASK  (0x1000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF24_SHIFT (24U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF24_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF24(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF24_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF24_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF25_MASK  (0x2000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF25_SHIFT (25U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF25_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF25(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF25_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF25_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF26_MASK  (0x4000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF26_SHIFT (26U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF26_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF26(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF26_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF26_MASK)

