zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF27_MASK  (0x8000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF27_SHIFT (27U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF27_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF27(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF27_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF27_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF28_MASK  (0x10000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF28_SHIFT (28U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF28_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF28(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF28_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF28_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF29_MASK  (0x20000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF29_SHIFT (29U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF29_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF29(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF29_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF29_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF30_MASK  (0x40000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF30_SHIFT (30U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF30_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF30(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF30_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF30_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF31_MASK  (0x80000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF31_SHIFT (31U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF31_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF31(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF31_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF31_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF32_MASK  (0x1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF32_SHIFT (0U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF32_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF32(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF32_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF32_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF33_MASK  (0x2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF33_SHIFT (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF33_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF33(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF33_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF33_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF34_MASK  (0x4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF34_SHIFT (2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF34_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF34(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF34_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF34_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF35_MASK  (0x8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF35_SHIFT (3U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF35_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF35(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF35_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF35_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF36_MASK  (0x10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF36_SHIFT (4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF36_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF36(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF36_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF36_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF37_MASK  (0x20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF37_SHIFT (5U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF37_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF37(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF37_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF37_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF38_MASK  (0x40U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF38_SHIFT (6U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF38_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF38(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF38_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF38_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF39_MASK  (0x80U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF39_SHIFT (7U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF39_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF39(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF39_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF39_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF40_MASK  (0x100U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF40_SHIFT (8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF40_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF40(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF40_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF40_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF41_MASK  (0x200U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF41_SHIFT (9U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF41_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF41(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF41_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF41_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF42_MASK  (0x400U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF42_SHIFT (10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF42_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF42(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF42_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF42_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF43_MASK  (0x800U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF43_SHIFT (11U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF43_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF43(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF43_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF43_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF44_MASK  (0x1000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF44_SHIFT (12U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF44_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF44(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF44_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF44_MASK)

