zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF45_MASK  (0x2000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF45_SHIFT (13U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF45_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF45(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF45_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF45_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF46_MASK  (0x4000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF46_SHIFT (14U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF46_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF46(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF46_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF46_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF47_MASK  (0x8000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF47_SHIFT (15U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF47_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF47(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF47_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF47_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF48_MASK  (0x10000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF48_SHIFT (16U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF48_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF48(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF48_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF48_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF49_MASK  (0x20000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF49_SHIFT (17U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF49_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF49(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF49_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF49_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF50_MASK  (0x40000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF50_SHIFT (18U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF50_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF50(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF50_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF50_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF51_MASK  (0x80000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF51_SHIFT (19U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF51_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF51(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF51_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF51_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF52_MASK  (0x100000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF52_SHIFT (20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF52_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF52(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF52_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF52_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF53_MASK  (0x200000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF53_SHIFT (21U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF53_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF53(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF53_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF53_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF54_MASK  (0x400000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF54_SHIFT (22U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF54_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF54(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF54_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF54_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF55_MASK  (0x800000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF55_SHIFT (23U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF55_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF55(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF55_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF55_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF56_MASK  (0x1000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF56_SHIFT (24U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF56_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF56(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF56_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF56_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF57_MASK  (0x2000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF57_SHIFT (25U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF57_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF57(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF57_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF57_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF58_MASK  (0x4000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF58_SHIFT (26U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF58_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF58(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF58_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF58_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF59_MASK  (0x8000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF59_SHIFT (27U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF59_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF59(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF59_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF59_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF60_MASK  (0x10000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF60_SHIFT (28U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF60_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF60(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF60_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF60_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF61_MASK  (0x20000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF61_SHIFT (29U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF61_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF61(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF61_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF61_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF62_MASK  (0x40000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF62_SHIFT (30U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF62_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF62(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF62_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF62_MASK)

