zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF63_MASK  (0x80000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF63_SHIFT (31U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF63_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF63(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF63_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF63_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF64_MASK  (0x1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF64_SHIFT (0U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF64_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF64(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF64_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF64_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF65_MASK  (0x2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF65_SHIFT (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF65_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF65(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF65_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF65_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF66_MASK  (0x4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF66_SHIFT (2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF66_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF66(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF66_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF66_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF67_MASK  (0x8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF67_SHIFT (3U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF67_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF67(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF67_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF67_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF68_MASK  (0x10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF68_SHIFT (4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF68_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF68(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF68_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF68_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF69_MASK  (0x20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF69_SHIFT (5U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF69_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF69(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF69_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF69_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF70_MASK  (0x40U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF70_SHIFT (6U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF70_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF70(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF70_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF70_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF71_MASK  (0x80U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF71_SHIFT (7U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF71_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF71(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF71_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF71_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF72_MASK  (0x100U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF72_SHIFT (8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF72_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF72(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF72_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF72_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF73_MASK  (0x200U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF73_SHIFT (9U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF73_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF73(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF73_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF73_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF74_MASK  (0x400U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF74_SHIFT (10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF74_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF74(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF74_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF74_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF75_MASK  (0x800U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF75_SHIFT (11U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF75_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF75(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF75_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF75_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF76_MASK  (0x1000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF76_SHIFT (12U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF76_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF76(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF76_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF76_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF77_MASK  (0x2000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF77_SHIFT (13U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF77_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF77(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF77_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF77_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF78_MASK  (0x4000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF78_SHIFT (14U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF78_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF78(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF78_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF78_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF79_MASK  (0x8000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF79_SHIFT (15U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF79_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF79(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF79_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF79_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF80_MASK  (0x10000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF80_SHIFT (16U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF80_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF80(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF80_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF80_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF81_MASK  (0x20000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF81_SHIFT (17U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF81_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF81(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF81_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF81_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF82_MASK  (0x40000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF82_SHIFT (18U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF82_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF82(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF82_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF82_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF83_MASK  (0x80000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF83_SHIFT (19U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF83_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF83(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF83_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF83_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF84_MASK  (0x100000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF84_SHIFT (20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF84_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF84(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF84_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF84_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF85_MASK  (0x200000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF85_SHIFT (21U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF85_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF85(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF85_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF85_MASK)

