zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF86_MASK  (0x400000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF86_SHIFT (22U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF86_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF86(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF86_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF86_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF87_MASK  (0x800000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF87_SHIFT (23U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF87_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF87(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF87_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF87_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF88_MASK  (0x1000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF88_SHIFT (24U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF88_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF88(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF88_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF88_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF89_MASK  (0x2000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF89_SHIFT (25U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF89_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF89(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF89_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF89_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF90_MASK  (0x4000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF90_SHIFT (26U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF90_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF90(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF90_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF90_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF91_MASK  (0x8000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF91_SHIFT (27U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF91_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF91(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF91_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF91_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF92_MASK  (0x10000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF92_SHIFT (28U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF92_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF92(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF92_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF92_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF93_MASK  (0x20000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF93_SHIFT (29U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF93_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF93(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF93_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF93_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF94_MASK  (0x40000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF94_SHIFT (30U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF94_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF94(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF94_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF94_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF95_MASK  (0x80000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF95_SHIFT (31U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF95_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF95(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF95_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF95_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF96_MASK  (0x1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF96_SHIFT (0U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF96_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF96(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF96_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF96_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF97_MASK  (0x2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF97_SHIFT (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF97_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF97(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF97_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF97_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF98_MASK  (0x4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF98_SHIFT (2U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF98_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF98(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF98_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF98_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF99_MASK  (0x8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF99_SHIFT (3U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF99_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF99(x)    (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF99_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF99_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF100_MASK (0x10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF100_SHIFT (4U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF100_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF100(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF100_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF100_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF101_MASK (0x20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF101_SHIFT (5U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF101_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF101(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF101_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF101_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF102_MASK (0x40U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF102_SHIFT (6U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF102_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF102(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF102_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF102_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF103_MASK (0x80U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF103_SHIFT (7U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF103_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF103(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF103_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF103_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF104_MASK (0x100U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF104_SHIFT (8U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF104_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF104(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF104_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF104_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF105_MASK (0x200U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF105_SHIFT (9U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF105_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF105(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF105_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF105_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF106_MASK (0x400U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF106_SHIFT (10U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF106_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF106(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF106_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF106_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF107_MASK (0x800U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF107_SHIFT (11U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF107_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF107(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF107_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF107_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF108_MASK (0x1000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF108_SHIFT (12U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF108_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF108(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF108_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF108_MASK)

