zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF109_MASK (0x2000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF109_SHIFT (13U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF109_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF109(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF109_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF109_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF110_MASK (0x4000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF110_SHIFT (14U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF110_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF110(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF110_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF110_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF111_MASK (0x8000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF111_SHIFT (15U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF111_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF111(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF111_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF111_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF112_MASK (0x10000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF112_SHIFT (16U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF112_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF112(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF112_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF112_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF113_MASK (0x20000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF113_SHIFT (17U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF113_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF113(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF113_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF113_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF114_MASK (0x40000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF114_SHIFT (18U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF114_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF114(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF114_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF114_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF115_MASK (0x80000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF115_SHIFT (19U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF115_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF115(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF115_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF115_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF116_MASK (0x100000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF116_SHIFT (20U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF116_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF116(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF116_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF116_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF117_MASK (0x200000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF117_SHIFT (21U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF117_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF117(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF117_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF117_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF118_MASK (0x400000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF118_SHIFT (22U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF118_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF118(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF118_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF118_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF119_MASK (0x800000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF119_SHIFT (23U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF119_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF119(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF119_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF119_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF120_MASK (0x1000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF120_SHIFT (24U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF120_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF120(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF120_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF120_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF121_MASK (0x2000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF121_SHIFT (25U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF121_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF121(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF121_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF121_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF122_MASK (0x4000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF122_SHIFT (26U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF122_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF122(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF122_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF122_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF123_MASK (0x8000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF123_SHIFT (27U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF123_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF123(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF123_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF123_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF124_MASK (0x10000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF124_SHIFT (28U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF124_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF124(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF124_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF124_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF125_MASK (0x20000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF125_SHIFT (29U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF125_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF125(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF125_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF125_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF126_MASK (0x40000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF126_SHIFT (30U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF126_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF126(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF126_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF126_MASK)

#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF127_MASK (0x80000000U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF127_SHIFT (31U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF127_WIDTH (1U)
#define CANXL_GRP_CONTROL_OVERRUNF_OVRRF127(x)   (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_OVERRUNF_OVRRF127_SHIFT)) & CANXL_GRP_CONTROL_OVERRUNF_OVRRF127_MASK)
/*! @} */

