zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
/*! @name URUNF - Under Run Flag 1..Under Run Flag 4 */
/*! @{ */

#define CANXL_GRP_CONTROL_URUNF_URUNF0_MASK      (0x1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF0_SHIFT     (0U)
#define CANXL_GRP_CONTROL_URUNF_URUNF0_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF0(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF0_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF0_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF1_MASK      (0x2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF1_SHIFT     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF1_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF1(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF1_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF1_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF2_MASK      (0x4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF2_SHIFT     (2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF2_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF2(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF2_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF2_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF3_MASK      (0x8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF3_SHIFT     (3U)
#define CANXL_GRP_CONTROL_URUNF_URUNF3_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF3(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF3_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF3_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF4_MASK      (0x10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF4_SHIFT     (4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF4_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF4(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF4_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF4_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF5_MASK      (0x20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF5_SHIFT     (5U)
#define CANXL_GRP_CONTROL_URUNF_URUNF5_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF5(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF5_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF5_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF6_MASK      (0x40U)
#define CANXL_GRP_CONTROL_URUNF_URUNF6_SHIFT     (6U)
#define CANXL_GRP_CONTROL_URUNF_URUNF6_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF6(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF6_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF6_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF7_MASK      (0x80U)
#define CANXL_GRP_CONTROL_URUNF_URUNF7_SHIFT     (7U)
#define CANXL_GRP_CONTROL_URUNF_URUNF7_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF7(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF7_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF7_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF8_MASK      (0x100U)
#define CANXL_GRP_CONTROL_URUNF_URUNF8_SHIFT     (8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF8_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF8(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF8_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF8_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF9_MASK      (0x200U)
#define CANXL_GRP_CONTROL_URUNF_URUNF9_SHIFT     (9U)
#define CANXL_GRP_CONTROL_URUNF_URUNF9_WIDTH     (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF9(x)        (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF9_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF9_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF10_MASK     (0x400U)
#define CANXL_GRP_CONTROL_URUNF_URUNF10_SHIFT    (10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF10_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF10(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF10_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF10_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF11_MASK     (0x800U)
#define CANXL_GRP_CONTROL_URUNF_URUNF11_SHIFT    (11U)
#define CANXL_GRP_CONTROL_URUNF_URUNF11_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF11(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF11_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF11_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF12_MASK     (0x1000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF12_SHIFT    (12U)
#define CANXL_GRP_CONTROL_URUNF_URUNF12_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF12(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF12_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF12_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF13_MASK     (0x2000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF13_SHIFT    (13U)
#define CANXL_GRP_CONTROL_URUNF_URUNF13_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF13(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF13_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF13_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF14_MASK     (0x4000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF14_SHIFT    (14U)
#define CANXL_GRP_CONTROL_URUNF_URUNF14_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF14(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF14_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF14_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF15_MASK     (0x8000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF15_SHIFT    (15U)
#define CANXL_GRP_CONTROL_URUNF_URUNF15_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF15(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF15_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF15_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF16_MASK     (0x10000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF16_SHIFT    (16U)
#define CANXL_GRP_CONTROL_URUNF_URUNF16_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF16(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF16_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF16_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF17_MASK     (0x20000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF17_SHIFT    (17U)
#define CANXL_GRP_CONTROL_URUNF_URUNF17_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF17(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF17_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF17_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF18_MASK     (0x40000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF18_SHIFT    (18U)
#define CANXL_GRP_CONTROL_URUNF_URUNF18_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF18(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF18_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF18_MASK)

