zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_URUNF_URUNF19_MASK     (0x80000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF19_SHIFT    (19U)
#define CANXL_GRP_CONTROL_URUNF_URUNF19_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF19(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF19_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF19_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF20_MASK     (0x100000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF20_SHIFT    (20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF20_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF20(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF20_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF20_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF21_MASK     (0x200000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF21_SHIFT    (21U)
#define CANXL_GRP_CONTROL_URUNF_URUNF21_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF21(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF21_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF21_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF22_MASK     (0x400000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF22_SHIFT    (22U)
#define CANXL_GRP_CONTROL_URUNF_URUNF22_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF22(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF22_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF22_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF23_MASK     (0x800000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF23_SHIFT    (23U)
#define CANXL_GRP_CONTROL_URUNF_URUNF23_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF23(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF23_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF23_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF24_MASK     (0x1000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF24_SHIFT    (24U)
#define CANXL_GRP_CONTROL_URUNF_URUNF24_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF24(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF24_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF24_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF25_MASK     (0x2000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF25_SHIFT    (25U)
#define CANXL_GRP_CONTROL_URUNF_URUNF25_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF25(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF25_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF25_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF26_MASK     (0x4000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF26_SHIFT    (26U)
#define CANXL_GRP_CONTROL_URUNF_URUNF26_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF26(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF26_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF26_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF27_MASK     (0x8000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF27_SHIFT    (27U)
#define CANXL_GRP_CONTROL_URUNF_URUNF27_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF27(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF27_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF27_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF28_MASK     (0x10000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF28_SHIFT    (28U)
#define CANXL_GRP_CONTROL_URUNF_URUNF28_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF28(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF28_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF28_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF29_MASK     (0x20000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF29_SHIFT    (29U)
#define CANXL_GRP_CONTROL_URUNF_URUNF29_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF29(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF29_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF29_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF30_MASK     (0x40000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF30_SHIFT    (30U)
#define CANXL_GRP_CONTROL_URUNF_URUNF30_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF30(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF30_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF30_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF31_MASK     (0x80000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF31_SHIFT    (31U)
#define CANXL_GRP_CONTROL_URUNF_URUNF31_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF31(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF31_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF31_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF32_MASK     (0x1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF32_SHIFT    (0U)
#define CANXL_GRP_CONTROL_URUNF_URUNF32_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF32(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF32_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF32_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF33_MASK     (0x2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF33_SHIFT    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF33_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF33(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF33_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF33_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF34_MASK     (0x4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF34_SHIFT    (2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF34_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF34(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF34_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF34_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF35_MASK     (0x8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF35_SHIFT    (3U)
#define CANXL_GRP_CONTROL_URUNF_URUNF35_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF35(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF35_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF35_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF36_MASK     (0x10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF36_SHIFT    (4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF36_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF36(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF36_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF36_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF37_MASK     (0x20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF37_SHIFT    (5U)
#define CANXL_GRP_CONTROL_URUNF_URUNF37_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF37(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF37_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF37_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF38_MASK     (0x40U)
#define CANXL_GRP_CONTROL_URUNF_URUNF38_SHIFT    (6U)
#define CANXL_GRP_CONTROL_URUNF_URUNF38_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF38(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF38_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF38_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF39_MASK     (0x80U)
#define CANXL_GRP_CONTROL_URUNF_URUNF39_SHIFT    (7U)
#define CANXL_GRP_CONTROL_URUNF_URUNF39_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF39(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF39_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF39_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF40_MASK     (0x100U)
#define CANXL_GRP_CONTROL_URUNF_URUNF40_SHIFT    (8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF40_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF40(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF40_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF40_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF41_MASK     (0x200U)
#define CANXL_GRP_CONTROL_URUNF_URUNF41_SHIFT    (9U)
#define CANXL_GRP_CONTROL_URUNF_URUNF41_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF41(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF41_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF41_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF42_MASK     (0x400U)
#define CANXL_GRP_CONTROL_URUNF_URUNF42_SHIFT    (10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF42_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF42(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF42_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF42_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF43_MASK     (0x800U)
#define CANXL_GRP_CONTROL_URUNF_URUNF43_SHIFT    (11U)
#define CANXL_GRP_CONTROL_URUNF_URUNF43_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF43(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF43_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF43_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF44_MASK     (0x1000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF44_SHIFT    (12U)
#define CANXL_GRP_CONTROL_URUNF_URUNF44_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF44(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF44_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF44_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF45_MASK     (0x2000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF45_SHIFT    (13U)
#define CANXL_GRP_CONTROL_URUNF_URUNF45_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF45(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF45_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF45_MASK)

