zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_URUNF_URUNF46_MASK     (0x4000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF46_SHIFT    (14U)
#define CANXL_GRP_CONTROL_URUNF_URUNF46_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF46(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF46_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF46_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF47_MASK     (0x8000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF47_SHIFT    (15U)
#define CANXL_GRP_CONTROL_URUNF_URUNF47_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF47(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF47_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF47_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF48_MASK     (0x10000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF48_SHIFT    (16U)
#define CANXL_GRP_CONTROL_URUNF_URUNF48_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF48(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF48_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF48_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF49_MASK     (0x20000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF49_SHIFT    (17U)
#define CANXL_GRP_CONTROL_URUNF_URUNF49_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF49(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF49_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF49_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF50_MASK     (0x40000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF50_SHIFT    (18U)
#define CANXL_GRP_CONTROL_URUNF_URUNF50_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF50(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF50_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF50_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF51_MASK     (0x80000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF51_SHIFT    (19U)
#define CANXL_GRP_CONTROL_URUNF_URUNF51_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF51(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF51_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF51_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF52_MASK     (0x100000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF52_SHIFT    (20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF52_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF52(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF52_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF52_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF53_MASK     (0x200000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF53_SHIFT    (21U)
#define CANXL_GRP_CONTROL_URUNF_URUNF53_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF53(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF53_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF53_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF54_MASK     (0x400000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF54_SHIFT    (22U)
#define CANXL_GRP_CONTROL_URUNF_URUNF54_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF54(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF54_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF54_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF55_MASK     (0x800000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF55_SHIFT    (23U)
#define CANXL_GRP_CONTROL_URUNF_URUNF55_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF55(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF55_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF55_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF56_MASK     (0x1000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF56_SHIFT    (24U)
#define CANXL_GRP_CONTROL_URUNF_URUNF56_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF56(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF56_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF56_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF57_MASK     (0x2000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF57_SHIFT    (25U)
#define CANXL_GRP_CONTROL_URUNF_URUNF57_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF57(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF57_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF57_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF58_MASK     (0x4000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF58_SHIFT    (26U)
#define CANXL_GRP_CONTROL_URUNF_URUNF58_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF58(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF58_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF58_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF59_MASK     (0x8000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF59_SHIFT    (27U)
#define CANXL_GRP_CONTROL_URUNF_URUNF59_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF59(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF59_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF59_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF60_MASK     (0x10000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF60_SHIFT    (28U)
#define CANXL_GRP_CONTROL_URUNF_URUNF60_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF60(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF60_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF60_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF61_MASK     (0x20000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF61_SHIFT    (29U)
#define CANXL_GRP_CONTROL_URUNF_URUNF61_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF61(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF61_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF61_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF62_MASK     (0x40000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF62_SHIFT    (30U)
#define CANXL_GRP_CONTROL_URUNF_URUNF62_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF62(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF62_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF62_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF63_MASK     (0x80000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF63_SHIFT    (31U)
#define CANXL_GRP_CONTROL_URUNF_URUNF63_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF63(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF63_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF63_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF64_MASK     (0x1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF64_SHIFT    (0U)
#define CANXL_GRP_CONTROL_URUNF_URUNF64_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF64(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF64_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF64_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF65_MASK     (0x2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF65_SHIFT    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF65_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF65(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF65_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF65_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF66_MASK     (0x4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF66_SHIFT    (2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF66_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF66(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF66_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF66_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF67_MASK     (0x8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF67_SHIFT    (3U)
#define CANXL_GRP_CONTROL_URUNF_URUNF67_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF67(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF67_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF67_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF68_MASK     (0x10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF68_SHIFT    (4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF68_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF68(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF68_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF68_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF69_MASK     (0x20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF69_SHIFT    (5U)
#define CANXL_GRP_CONTROL_URUNF_URUNF69_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF69(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF69_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF69_MASK)

