zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_URUNF_URUNF70_MASK     (0x40U)
#define CANXL_GRP_CONTROL_URUNF_URUNF70_SHIFT    (6U)
#define CANXL_GRP_CONTROL_URUNF_URUNF70_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF70(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF70_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF70_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF71_MASK     (0x80U)
#define CANXL_GRP_CONTROL_URUNF_URUNF71_SHIFT    (7U)
#define CANXL_GRP_CONTROL_URUNF_URUNF71_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF71(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF71_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF71_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF72_MASK     (0x100U)
#define CANXL_GRP_CONTROL_URUNF_URUNF72_SHIFT    (8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF72_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF72(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF72_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF72_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF73_MASK     (0x200U)
#define CANXL_GRP_CONTROL_URUNF_URUNF73_SHIFT    (9U)
#define CANXL_GRP_CONTROL_URUNF_URUNF73_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF73(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF73_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF73_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF74_MASK     (0x400U)
#define CANXL_GRP_CONTROL_URUNF_URUNF74_SHIFT    (10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF74_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF74(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF74_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF74_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF75_MASK     (0x800U)
#define CANXL_GRP_CONTROL_URUNF_URUNF75_SHIFT    (11U)
#define CANXL_GRP_CONTROL_URUNF_URUNF75_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF75(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF75_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF75_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF76_MASK     (0x1000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF76_SHIFT    (12U)
#define CANXL_GRP_CONTROL_URUNF_URUNF76_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF76(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF76_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF76_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF77_MASK     (0x2000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF77_SHIFT    (13U)
#define CANXL_GRP_CONTROL_URUNF_URUNF77_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF77(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF77_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF77_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF78_MASK     (0x4000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF78_SHIFT    (14U)
#define CANXL_GRP_CONTROL_URUNF_URUNF78_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF78(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF78_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF78_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF79_MASK     (0x8000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF79_SHIFT    (15U)
#define CANXL_GRP_CONTROL_URUNF_URUNF79_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF79(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF79_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF79_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF80_MASK     (0x10000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF80_SHIFT    (16U)
#define CANXL_GRP_CONTROL_URUNF_URUNF80_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF80(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF80_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF80_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF81_MASK     (0x20000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF81_SHIFT    (17U)
#define CANXL_GRP_CONTROL_URUNF_URUNF81_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF81(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF81_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF81_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF82_MASK     (0x40000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF82_SHIFT    (18U)
#define CANXL_GRP_CONTROL_URUNF_URUNF82_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF82(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF82_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF82_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF83_MASK     (0x80000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF83_SHIFT    (19U)
#define CANXL_GRP_CONTROL_URUNF_URUNF83_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF83(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF83_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF83_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF84_MASK     (0x100000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF84_SHIFT    (20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF84_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF84(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF84_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF84_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF85_MASK     (0x200000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF85_SHIFT    (21U)
#define CANXL_GRP_CONTROL_URUNF_URUNF85_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF85(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF85_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF85_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF86_MASK     (0x400000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF86_SHIFT    (22U)
#define CANXL_GRP_CONTROL_URUNF_URUNF86_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF86(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF86_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF86_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF87_MASK     (0x800000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF87_SHIFT    (23U)
#define CANXL_GRP_CONTROL_URUNF_URUNF87_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF87(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF87_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF87_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF88_MASK     (0x1000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF88_SHIFT    (24U)
#define CANXL_GRP_CONTROL_URUNF_URUNF88_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF88(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF88_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF88_MASK)

