zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_URUNF_URUNF89_MASK     (0x2000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF89_SHIFT    (25U)
#define CANXL_GRP_CONTROL_URUNF_URUNF89_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF89(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF89_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF89_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF90_MASK     (0x4000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF90_SHIFT    (26U)
#define CANXL_GRP_CONTROL_URUNF_URUNF90_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF90(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF90_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF90_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF91_MASK     (0x8000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF91_SHIFT    (27U)
#define CANXL_GRP_CONTROL_URUNF_URUNF91_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF91(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF91_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF91_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF92_MASK     (0x10000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF92_SHIFT    (28U)
#define CANXL_GRP_CONTROL_URUNF_URUNF92_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF92(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF92_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF92_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF93_MASK     (0x20000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF93_SHIFT    (29U)
#define CANXL_GRP_CONTROL_URUNF_URUNF93_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF93(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF93_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF93_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF94_MASK     (0x40000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF94_SHIFT    (30U)
#define CANXL_GRP_CONTROL_URUNF_URUNF94_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF94(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF94_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF94_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF95_MASK     (0x80000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF95_SHIFT    (31U)
#define CANXL_GRP_CONTROL_URUNF_URUNF95_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF95(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF95_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF95_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF96_MASK     (0x1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF96_SHIFT    (0U)
#define CANXL_GRP_CONTROL_URUNF_URUNF96_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF96(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF96_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF96_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF97_MASK     (0x2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF97_SHIFT    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF97_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF97(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF97_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF97_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF98_MASK     (0x4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF98_SHIFT    (2U)
#define CANXL_GRP_CONTROL_URUNF_URUNF98_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF98(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF98_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF98_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF99_MASK     (0x8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF99_SHIFT    (3U)
#define CANXL_GRP_CONTROL_URUNF_URUNF99_WIDTH    (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF99(x)       (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF99_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF99_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF100_MASK    (0x10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF100_SHIFT   (4U)
#define CANXL_GRP_CONTROL_URUNF_URUNF100_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF100(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF100_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF100_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF101_MASK    (0x20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF101_SHIFT   (5U)
#define CANXL_GRP_CONTROL_URUNF_URUNF101_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF101(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF101_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF101_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF102_MASK    (0x40U)
#define CANXL_GRP_CONTROL_URUNF_URUNF102_SHIFT   (6U)
#define CANXL_GRP_CONTROL_URUNF_URUNF102_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF102(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF102_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF102_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF103_MASK    (0x80U)
#define CANXL_GRP_CONTROL_URUNF_URUNF103_SHIFT   (7U)
#define CANXL_GRP_CONTROL_URUNF_URUNF103_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF103(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF103_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF103_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF104_MASK    (0x100U)
#define CANXL_GRP_CONTROL_URUNF_URUNF104_SHIFT   (8U)
#define CANXL_GRP_CONTROL_URUNF_URUNF104_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF104(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF104_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF104_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF105_MASK    (0x200U)
#define CANXL_GRP_CONTROL_URUNF_URUNF105_SHIFT   (9U)
#define CANXL_GRP_CONTROL_URUNF_URUNF105_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF105(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF105_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF105_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF106_MASK    (0x400U)
#define CANXL_GRP_CONTROL_URUNF_URUNF106_SHIFT   (10U)
#define CANXL_GRP_CONTROL_URUNF_URUNF106_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF106(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF106_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF106_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF107_MASK    (0x800U)
#define CANXL_GRP_CONTROL_URUNF_URUNF107_SHIFT   (11U)
#define CANXL_GRP_CONTROL_URUNF_URUNF107_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF107(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF107_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF107_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF108_MASK    (0x1000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF108_SHIFT   (12U)
#define CANXL_GRP_CONTROL_URUNF_URUNF108_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF108(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF108_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF108_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF109_MASK    (0x2000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF109_SHIFT   (13U)
#define CANXL_GRP_CONTROL_URUNF_URUNF109_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF109(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF109_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF109_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF110_MASK    (0x4000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF110_SHIFT   (14U)
#define CANXL_GRP_CONTROL_URUNF_URUNF110_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF110(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF110_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF110_MASK)

