zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CANXL_GRP_CONTROL.h
#define CANXL_GRP_CONTROL_URUNF_URUNF111_MASK    (0x8000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF111_SHIFT   (15U)
#define CANXL_GRP_CONTROL_URUNF_URUNF111_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF111(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF111_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF111_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF112_MASK    (0x10000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF112_SHIFT   (16U)
#define CANXL_GRP_CONTROL_URUNF_URUNF112_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF112(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF112_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF112_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF113_MASK    (0x20000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF113_SHIFT   (17U)
#define CANXL_GRP_CONTROL_URUNF_URUNF113_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF113(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF113_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF113_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF114_MASK    (0x40000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF114_SHIFT   (18U)
#define CANXL_GRP_CONTROL_URUNF_URUNF114_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF114(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF114_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF114_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF115_MASK    (0x80000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF115_SHIFT   (19U)
#define CANXL_GRP_CONTROL_URUNF_URUNF115_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF115(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF115_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF115_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF116_MASK    (0x100000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF116_SHIFT   (20U)
#define CANXL_GRP_CONTROL_URUNF_URUNF116_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF116(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF116_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF116_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF117_MASK    (0x200000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF117_SHIFT   (21U)
#define CANXL_GRP_CONTROL_URUNF_URUNF117_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF117(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF117_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF117_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF118_MASK    (0x400000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF118_SHIFT   (22U)
#define CANXL_GRP_CONTROL_URUNF_URUNF118_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF118(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF118_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF118_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF119_MASK    (0x800000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF119_SHIFT   (23U)
#define CANXL_GRP_CONTROL_URUNF_URUNF119_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF119(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF119_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF119_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF120_MASK    (0x1000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF120_SHIFT   (24U)
#define CANXL_GRP_CONTROL_URUNF_URUNF120_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF120(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF120_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF120_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF121_MASK    (0x2000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF121_SHIFT   (25U)
#define CANXL_GRP_CONTROL_URUNF_URUNF121_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF121(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF121_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF121_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF122_MASK    (0x4000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF122_SHIFT   (26U)
#define CANXL_GRP_CONTROL_URUNF_URUNF122_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF122(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF122_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF122_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF123_MASK    (0x8000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF123_SHIFT   (27U)
#define CANXL_GRP_CONTROL_URUNF_URUNF123_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF123(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF123_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF123_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF124_MASK    (0x10000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF124_SHIFT   (28U)
#define CANXL_GRP_CONTROL_URUNF_URUNF124_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF124(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF124_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF124_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF125_MASK    (0x20000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF125_SHIFT   (29U)
#define CANXL_GRP_CONTROL_URUNF_URUNF125_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF125(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF125_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF125_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF126_MASK    (0x40000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF126_SHIFT   (30U)
#define CANXL_GRP_CONTROL_URUNF_URUNF126_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF126(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF126_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF126_MASK)

#define CANXL_GRP_CONTROL_URUNF_URUNF127_MASK    (0x80000000U)
#define CANXL_GRP_CONTROL_URUNF_URUNF127_SHIFT   (31U)
#define CANXL_GRP_CONTROL_URUNF_URUNF127_WIDTH   (1U)
#define CANXL_GRP_CONTROL_URUNF_URUNF127(x)      (((uint32_t)(((uint32_t)(x)) << CANXL_GRP_CONTROL_URUNF_URUNF127_SHIFT)) & CANXL_GRP_CONTROL_URUNF_URUNF127_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CANXL_GRP_CONTROL_Register_Masks */

/*!
 * @}
 */ /* end of group CANXL_GRP_CONTROL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CANXL_GRP_CONTROL_H_) */
